<font size=5><font color='darkslateblue'>
<b>SQL</b></font>

Коронавирус застал мир врасплох, изменив привычный порядок вещей. В свободное время жители городов больше не выходят на улицу, не посещают кафе и торговые центры. Зато стало больше времени для книг. Это заметили стартаперы — и бросились создавать приложения для тех, кто любит читать.

Ваша компания решила быть на волне и купила крупный сервис для чтения книг по подписке. Ваша первая задача как аналитика — проанализировать базу данных.

В ней — информация о книгах, издательствах, авторах, а также пользовательские обзоры книг. Эти данные помогут сформулировать ценностное предложение для нового продукта.

## Описание данных

<b>Таблица `books` сдержит данные о книгах:</b>
* `book_id` — идентификатор книги;
* `author_id` — идентификатор автора;
* `title` — название книги;
* `num_pages` — количество страниц;
* `publication_date` — дата публикации книги;
* `publisher_id` — идентификатор издателя.

<b>Таблица `authors` содержит данные об авторах:</b>
* `author_id` — идентификатор автора;
* `author`— имя автора.
 
<b>Таблица `publishers` содержит данные об издательствах:</b>
* `publishers_id` — идентификатор издательства;
* `publisher`—	название издательства;

<b>Таблица `ratings` содержит данные о пользовательских оценках книг:</b>
* `rating_id`—	идентификатор оценки;
* `book_id`— идентификатор книги;
* `username`— имя пользователя, оставившего оценку;
* `rating`—	оценка книги.

<b>Таблица `reviews` содержит данные о пользовательских обзорах на книги:</b>
* `review_id`—	идентификатор обзора;
* `book_id`— идентификатор книги;
* `username`— имя пользователя, написавшего обзор;
* `text`— текст обзора.

## Задачи

* Посчитайте, сколько книг вышло после 1 января 2000 года;
* Для каждой книги посчитайте количество обзоров и среднюю оценку;
* Определите издательство, которое выпустило наибольшее число книг толще 50 страниц — так вы исключите из анализа брошюры;
* Определите автора с самой высокой средней оценкой книг — учитывайте только книги с 50 и более оценками;
* Посчитайте среднее количество обзоров от пользователей, которые поставили больше 50 оценок.

## Знакомство с таблицами

In [13]:
# импорт библиотек
import pandas as pd
from sqlalchemy import create_engine

pd.set_option('display.float_format', '{:,.2f}'.format)
pd.set_option('display.max_columns', None)
pd.options.display.max_colwidth = 150

In [14]:
# параметры
db_config = {'user': 'praktikum_student',  # имя пользователя
             'pwd': 'Sdf4$2;d-d30pp',  # пароль
             'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net',
             'port': '6432',  # порт подключения
             'db': 'data-analyst-final-project-db'}  # название базы данных

connection_string = 'postgresql://{}:{}@{}:{}/{}'.format(db_config['user'],
                                                         db_config['pwd'],
                                                         db_config['host'],
                                                         db_config['port'],
                                                         db_config['db'])

In [15]:
# сохраняем коннектор
engine = create_engine(connection_string, connect_args={'sslmode': 'require'})

In [16]:
#pd.io.sql.read_sql(query, con = engine)

### Таблица `books`

In [17]:
# запрос
query = '''
            SELECT * FROM books
        '''
books = pd.io.sql.read_sql(query, con=engine)

# вывод информации
books.head()

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope #1),322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before Columbus,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

### Таблица `authors`

In [18]:
# запрос
query = '''
            SELECT * FROM books
        '''
books = pd.io.sql.read_sql(query, con=engine)

# вывод информации
books.head()

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope #1),322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before Columbus,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

### Таблица `publishers`

In [19]:
# запрос
query = '''
            SELECT * FROM publishers
        '''
books = pd.io.sql.read_sql(query, con=engine)

# вывод информации
books.head()

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

### Таблица `ratings`

In [20]:
# запрос
query = '''
            SELECT * FROM ratings
        '''
books = pd.io.sql.read_sql(query, con=engine)

# вывод информации
books.head()

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

### Таблица `reviews`

In [21]:
# запрос
query = '''
            SELECT * FROM reviews
        '''
books = pd.io.sql.read_sql(query, con=engine)

# вывод информации
books.head()

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. Over provide race technology continue these.
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Among admit investment argue security.
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but person sport treatment industry. Kitchen decision deep the. Social party body the.
3,4,3,johnsonamanda,Finally month interesting blue could nature cultural bit. Prepare beat finish grow that smile teach. Dream me play near.
4,5,3,scotttamara,Nation purpose heavy give wait song will. List dinner another whole positive radio fast. Music staff many green.

## Задачи

### Сколько книг вышло после 1 января 2000 года

In [55]:
# запрос
query = '''
            SELECT
                COUNT(book_id)
            FROM books
            WHERE publication_date > '2000-01-01'
        '''

request_1 = pd.io.sql.read_sql(query, con=engine)

# вывод информации
request_1

   count
0    819

<b><i><font size=2.5> После 1 января 2000 года вышло 819 книг.

### Количество обзоров и средняя оценка каждой книги

In [68]:
# запрос
query = '''
            SELECT
                books.title,
                (
                    SELECT
                        COUNT(review_id) AS review_count
                    FROM reviews
                    WHERE book_id = books.book_id
                ),
                (
                    SELECT
                        AVG(rating)
                    FROM ratings
                    WHERE book_id = books.book_id) AS avg_rating
            FROM books, reviews
            GROUP BY books.book_id
            ORDER BY review_count DESC
            LIMIT 10
        '''

request_2 = pd.io.sql.read_sql(query, con=engine)

# вывод информации
request_2

,title,review_count,avg_rating
0,Twilight (Twilight #1),7,3.66
1,The Da Vinci Code (Robert Langdon #2),6,3.83
2,Eat Pray Love,6,3.40
3,The Alchemist,6,3.79
4,The Catcher in the Rye,6,3.83
5,The Curious Incident of the Dog in the Night-Time,6,4.08
6,Harry Potter and the Prisoner of Azkaban (Harry Potter #3),6,4.41
7,Harry Potter and the Chamber of Secrets (Harry Potter #2),6,4.29
8,Outlander (Outlander #1),6,4.12
9,The Book Thief,6,4.26

In [60]:
request_2.sort_values(by='avg_rating', ascending=False).head(1)

,title,review_count,avg_rating
6,Harry Potter and the Prisoner of Azkaban (Harry Potter #3),6,4.41

<b><i><font size=2.5> В десятке самых обозреваемых книг лидирует первая книга из цикла романов "Сумерки", 7 пользовательских обзоров. А самый высокий средний рейтинг 4,41 балла у "Гарри Поттер и узник Азкабана".

### Издательство, которое выпустило наибольшее число книг толще 50 страниц

In [54]:
# запрос
query = '''
            SELECT
                publishers.publisher,
            COUNT (book_id)
            FROM books INNER JOIN publishers
                ON books.publisher_id = publishers.publisher_id
            WHERE books.num_pages > 50
            GROUP BY publishers.publisher
            ORDER BY count DESC
            LIMIT 10
                
        '''

request_3 = pd.io.sql.read_sql(query, con=engine)

# вывод информации
request_3

                   publisher  count
0              Penguin Books     42
1                    Vintage     31
2   Grand Central Publishing     25
3           Penguin Classics     24
4           Ballantine Books     19
5                     Bantam     19
6                    Berkley     17
7         St. Martin's Press     14
8              Berkley Books     14
9  William Morrow Paperbacks     13

<b><i><font size=2.5> Самое активное издательство - британское "Penguin Books", им выпущено 42 книги с числом страниц больше 50.

### Автор с самой высокой средней оценкой книг — с учётом книги с 50 и более оценками

In [78]:
# запрос
query = '''
           SELECT
               author,
               AVG(pivot_table.rating) AS avg_rating
            FROM (
                SELECT
                    author,
                    title,
                    AVG(rating) AS rating
                    FROM (SELECT *
                            FROM books
                            WHERE book_id IN (
                                SELECT book_id
                                FROM ratings
                                GROUP BY book_id
                                HAVING COUNT(rating) >= 50
                         ) 
                ) 
                AS books_top50
                INNER JOIN authors ON books_top50.author_id = authors.author_id
                INNER JOIN ratings ON books_top50.book_id = ratings.book_id
                GROUP BY author, title
                ORDER BY author
                ) AS pivot_table
            GROUP BY author
            ORDER BY avg_rating DESC
            LIMIT 1
        '''
request_4 = pd.io.sql.read_sql(query, con=engine)

# вывод информации
request_4

                       author  avg_rating
0  J.K. Rowling/Mary GrandPré        4.28

<b><i><font size=2.5> Самым высокий средний рейтинг у книг Джоан Роулинг с иллюстрациями Мэри Грандпре, 4.3 балла среди всех книг, имеющих 50 и более оценок.

### Среднее количество обзоров от пользователей, которые поставили больше 50 оценок

In [79]:
# запрос # username
query = '''
            SELECT

                AVG(review_50.review_count) AS avg_review_count
            FROM (
                SELECT COUNT(review_id) AS review_count
                FROM reviews
                WHERE username IN (
                                SELECT username
                                FROM ratings
                                GROUP BY username
                                HAVING COUNT(rating) >= 50
                )
            GROUP BY username
            ) AS review_50
        '''
request_5 = pd.io.sql.read_sql(query, con=engine)

# вывод информации
request_5.head()

   avg_review_count
0             24.22

<b><i><font size=2.5> Активные пользователи, поставившие больше 50 оценок книгам также активно пишут и обзоры, в среднем на одного пользователя приходится 24 обзора.